reference/operations.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Pallet Reference - Operations</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-06-17 Thu"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content="Pallet reference for converge and lift operations"/>
<meta name="keywords" content="pallet reference documentation lift converge"/>
<link rel="stylesheet" type="text/css" href="../doc.css" />
</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<h1 class="title">Pallet Reference - Operations</h1>



<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Converge </h2>
<div class="outline-text-2" id="text-1">


<p>
The <code>converge</code> function can be used to adjust node counts and to apply phases.
The <code>:bootstrap</code> phase is the first phase applied to any new node that is
started, and <code>:configure</code> is always applied.  Additional phases may also be
specified. If the <code>:configure</code> phase is not explicitly passed, then it will
always be applied as the first phase (or second, after <code>:bootstrap</code> on new
nodes).
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.core)
(pallet.core/defnode mytag [])

(<span style="color: #4682b4;">defn</span> <span style="color: #0000ff;">scale-cluster</span> [n]
  (pallet.core/converge {mytag n}))
</pre>



<p>
<code>converge</code> also accepts a prefix, which is applied to the tags in the call.
This can be used to build job specific clusters.
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.core)
(pallet.core/defnode lb [] <span style="color: #0000ff;">:configure</span> [])
(pallet.core/defnode webapp [] <span style="color: #0000ff;">:configure</span> [])
(pallet.core/defnode db [] <span style="color: #0000ff;">:configure</span> [])

(<span style="color: #4682b4;">defn</span> <span style="color: #0000ff;">scale-cluster</span> [prefix n]
  (pallet.core/converge prefix {lb 1 webapp n db (<span style="color: #0000ff;">inc</span> (<span style="color: #0000ff;">/</span> n 2))}))
</pre>



</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Lift </h2>
<div class="outline-text-2" id="text-2">


<p>
The <code>lift</code> function is used to apply phases. The :configure phase is run by
default only if no phases are explicitly specified.
</p>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2010-06-17 Thu</p>
<p class="creator">HTML generated by org-mode 6.36trans in emacs 24</p>
</div>
</div>
</body>
</html>
